/*
 * @Description:
 * @Autor: lifangfang
 * @Date: 2018-12-04 15:17:36
 * @LastEditors: lifangfang
 * @LastEditTime: 2019-10-22 11:21:17
 */
let errMap = {
    1001: '传入的评测文本为空',
    1002: '没有上传音频', //是在文件评测的时候出现
    1003: '没有网络',
    1004: '传入评测过程服务端返回的错误码',
    1005: '没有录音',
    1006: '文本过长，最长支持16000字符',
    1007: '打分系数设置错误，可选范围0.6-1.9',
    1008: '评测模式设置错误，可以设置的值A、B、C、E、G、H',
    1009: '音频格式错误，可选值为: mp3 , opus , amrnb', //默认使用opus
    1010: '未设置评测服务地址或评测地址错误',
    1011: '无法打开麦克风，请使用https协议。', //Only secure origins are allowed(see https://goo.gl/Y0ZkNV)
    1012: '用户拒绝访问麦克风',
    1013: '浏览器不支持录音',
    1014: '找不到麦克风设备',
    1015: '无法打开麦克风',
    1016: '获取音频失败',
    1017: '解析失败'
};

export default errMap;
